In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
df1=pd.read_csv("campaign_data.csv")

In [3]:
df1.isnull().sum()

campaign_id      0
campaign_type    0
start_date       0
end_date         0
dtype: int64

In [4]:
df1.head()

   campaign_id campaign_type start_date  end_date
0           24             Y   21/10/13  20/12/13
1           25             Y   21/10/13  22/11/13
2           20             Y   07/09/13  16/11/13
3           23             Y   08/10/13  15/11/13
4           21             Y   16/09/13  18/10/13

In [0]:
df1['Year']=[d.split('/')[2] for d in df1.start_date]
df1['Month']=[d.split('/')[1] for d in df1.start_date]
df1['Day']=[d.split('/')[0] for d in df1.start_date]

In [6]:
df1.head()

   campaign_id campaign_type start_date  end_date Year Month Day
0           24             Y   21/10/13  20/12/13   13    10  21
1           25             Y   21/10/13  22/11/13   13    10  21
2           20             Y   07/09/13  16/11/13   13    09  07
3           23             Y   08/10/13  15/11/13   13    10  08
4           21             Y   16/09/13  18/10/13   13    09  16

In [0]:
df1['Year1']=[d.split('/')[2] for d in df1.end_date]
df1['Month1']=[d.split('/')[1] for d in df1.end_date]
df1['Day1']=[d.split('/')[0] for d in df1.end_date]

In [0]:
df1=df1.drop(columns="start_date",axis=1)

In [0]:
df1=df1.drop(columns="end_date",axis=1)

In [0]:
df1['Year'] = df1['Year'].astype(str).astype(int)
df1['Year1'] = df1['Year1'].astype(str).astype(int)
df1['Month'] = df1['Month'].astype(str).astype(int)
df1['Month1'] = df1['Month1'].astype(str).astype(int)
df1['Day'] = df1['Day'].astype(str).astype(int)
df1['Day1'] = df1['Day1'].astype(str).astype(int)

In [0]:
df1["time"]=(df1["Year1"]-df1["Year"])*365+(df1.Month1-df1.Month)*30+((30-df1.Day1)+df1.Day)

In [0]:
df1=df1.drop("Year",axis=1)
df1=df1.drop("Year1",axis=1)
df1=df1.drop("Month",axis=1)
df1=df1.drop("Month1",axis=1)
df1=df1.drop("Day",axis=1)
df1=df1.drop("Day1",axis=1)

In [13]:
df1.head()

   campaign_id campaign_type  time
0           24             Y    91
1           25             Y    59
2           20             Y    81
3           23             Y    53
4           21             Y    58

In [0]:
df2=pd.read_csv("customer_demographics.csv")

In [15]:
df2.head()

   customer_id age_range  ... no_of_children  income_bracket
0            1       70+  ...            NaN               4
1            6     46-55  ...            NaN               5
2            7     26-35  ...              1               3
3            8     26-35  ...              2               6
4           10     46-55  ...            NaN               5

[5 rows x 7 columns]

In [16]:
df2["age_range"].value_counts()

46-55    271
36-45    187
26-35    130
70+       68
56-70     59
18-25     45
Name: age_range, dtype: int64

In [0]:
df2["no_of_children"].fillna("0",inplace=True)

In [0]:
df2["marital_status"].fillna("Single",inplace=True)

In [19]:
df2.dtypes

customer_id        int64
age_range         object
marital_status    object
rented             int64
family_size       object
no_of_children    object
income_bracket     int64
dtype: object

In [20]:
dummies1=pd.get_dummies(df2.no_of_children)
dummies2=pd.get_dummies(df2.marital_status)
dummies3=pd.get_dummies(df2.age_range)
dummies4=pd.get_dummies(df2.family_size)
dummies3.head()

   18-25  26-35  36-45  46-55  56-70  70+
0      0      0      0      0      0    1
1      0      0      0      1      0    0
2      0      1      0      0      0    0
3      0      1      0      0      0    0
4      0      0      0      1      0    0

In [0]:
df2=pd.concat([df2,dummies1], axis=1)
df2=pd.concat([df2,dummies2], axis=1)
df2=pd.concat([df2,dummies3], axis=1)
df2=pd.concat([df2,dummies4], axis=1)

In [0]:
df2=df2.drop(["age_range","family_size","no_of_children","marital_status"],axis=1)

In [23]:
df2.head()

   customer_id  rented  income_bracket  0  1  2  3+  ...  56-70  70+  1  2  3  4  5+
0            1       0               4  1  0  0   0  ...      0    1  0  1  0  0   0
1            6       0               5  1  0  0   0  ...      0    0  0  1  0  0   0
2            7       0               3  0  1  0   0  ...      0    0  0  0  1  0   0
3            8       0               6  0  0  1   0  ...      0    0  0  0  0  1   0
4           10       0               5  1  0  0   0  ...      0    0  1  0  0  0   0

[5 rows x 20 columns]

In [24]:
df3=pd.read_csv("customer_transaction_data.csv")
df3.head()

         date  customer_id  ...  other_discount  coupon_discount
0  2012-01-02         1501  ...          -10.69              0.0
1  2012-01-02         1501  ...          -13.89              0.0
2  2012-01-02         1501  ...          -14.25              0.0
3  2012-01-02         1501  ...            0.00              0.0
4  2012-01-02         1501  ...          -28.14              0.0

[5 rows x 7 columns]

In [25]:
df3=df3.drop("date",axis=1)
df3.head()

   customer_id  item_id  ...  other_discount  coupon_discount
0         1501    26830  ...          -10.69              0.0
1         1501    54253  ...          -13.89              0.0
2         1501    31962  ...          -14.25              0.0
3         1501    33647  ...            0.00              0.0
4         1501    48199  ...          -28.14              0.0

[5 rows x 6 columns]

In [0]:
test=pd.read_csv("test.csv")

In [27]:
test.head()

   id  campaign_id  coupon_id  customer_id
0   3           22        869          967
1   4           20        389         1566
2   5           22        981          510
3   8           25       1069          361
4  10           17        498          811

In [0]:
train=pd.read_csv("train.csv")

In [29]:
train.head()

   id  campaign_id  coupon_id  customer_id  redemption_status
0   1           13         27         1053                  0
1   2           13        116           48                  0
2   6            9        635          205                  0
3   7           13        644         1050                  0
4   9            8       1017         1489                  0

In [0]:
df5=pd.read_csv("item_data.csv")

In [31]:
df5.head()

   item_id  brand   brand_type       category
0        1      1  Established        Grocery
1        2      1  Established  Miscellaneous
2        3     56        Local         Bakery
3        4     56        Local        Grocery
4        5     56        Local        Grocery

In [0]:
dum=pd.get_dummies(df5.brand_type)

In [0]:
df5=pd.concat([df5,dum],axis=1)

In [34]:
df5.head()

   item_id  brand   brand_type       category  Established  Local
0        1      1  Established        Grocery            1      0
1        2      1  Established  Miscellaneous            1      0
2        3     56        Local         Bakery            0      1
3        4     56        Local        Grocery            0      1
4        5     56        Local        Grocery            0      1

In [35]:
dum2=pd.get_dummies(df5.category)
dum2.head()

   Alcohol  Bakery  ...  Travel  Vegetables (cut)
0        0       0  ...       0                 0
1        0       0  ...       0                 0
2        0       1  ...       0                 0
3        0       0  ...       0                 0
4        0       0  ...       0                 0

[5 rows x 19 columns]

In [0]:
df5=pd.concat([df5,dum2],axis=1)

In [0]:
df5=df5.drop("category",axis=1)
df5=df5.drop("brand_type",axis=1)

In [38]:
df5.head()

   item_id  brand  Established  ...  Skin & Hair Care  Travel  Vegetables (cut)
0        1      1            1  ...                 0       0                 0
1        2      1            1  ...                 0       0                 0
2        3     56            0  ...                 0       0                 0
3        4     56            0  ...                 0       0                 0
4        5     56            0  ...                 0       0                 0

[5 rows x 23 columns]

In [39]:
df3.head()

   customer_id  item_id  ...  other_discount  coupon_discount
0         1501    26830  ...          -10.69              0.0
1         1501    54253  ...          -13.89              0.0
2         1501    31962  ...          -14.25              0.0
3         1501    33647  ...            0.00              0.0
4         1501    48199  ...          -28.14              0.0

[5 rows x 6 columns]

In [40]:
df2.head()

   customer_id  rented  income_bracket  0  1  2  3+  ...  56-70  70+  1  2  3  4  5+
0            1       0               4  1  0  0   0  ...      0    1  0  1  0  0   0
1            6       0               5  1  0  0   0  ...      0    0  0  1  0  0   0
2            7       0               3  0  1  0   0  ...      0    0  0  0  1  0   0
3            8       0               6  0  0  1   0  ...      0    0  0  0  0  1   0
4           10       0               5  1  0  0   0  ...      0    0  1  0  0  0   0

[5 rows x 20 columns]

In [41]:
df1.campaign_type.value_counts()

Y    22
X     6
Name: campaign_type, dtype: int64

In [0]:
dum3=pd.get_dummies(df1.campaign_type)

In [0]:
df1=pd.concat([df1,dum3],axis=1)

In [0]:
df1=df1.drop("campaign_type",axis=1)

In [45]:
df1.head()

   campaign_id  time  X  Y
0           24    91  0  1
1           25    59  0  1
2           20    81  0  1
3           23    53  0  1
4           21    58  0  1

In [46]:
df1.shape

(28, 4)

In [47]:
df2.shape

(760, 20)

In [48]:
train.shape

(78369, 5)

In [49]:
df3.head()

   customer_id  item_id  ...  other_discount  coupon_discount
0         1501    26830  ...          -10.69              0.0
1         1501    54253  ...          -13.89              0.0
2         1501    31962  ...          -14.25              0.0
3         1501    33647  ...            0.00              0.0
4         1501    48199  ...          -28.14              0.0

[5 rows x 6 columns]

In [0]:
train=pd.merge(train,df1,on="campaign_id")

In [0]:
df3=pd.merge(df3,df5,on="item_id")

In [52]:
data=pd.DataFrame(df3.customer_id.value_counts())
df3.head()

   customer_id  item_id  quantity  ...  Skin & Hair Care  Travel  Vegetables (cut)
0         1501    26830         1  ...                 0       0                 0
1          135    26830         1  ...                 0       0                 0
2          464    26830         1  ...                 0       0                 0
3         1185    26830         1  ...                 0       0                 0
4         1140    26830         1  ...                 0       0                 0

[5 rows x 28 columns]

In [0]:
df4=pd.read_csv("coupon_item_mapping.csv")

In [0]:
df6=pd.DataFrame(index=data.index,columns=df3.columns)
for i,n in enumerate(data.index):
  temp=pd.DataFrame(df3[df3.customer_id==n].sum())
  for j,m in enumerate(temp.index):
    df6.loc[n,m]=temp.loc[m,0]

In [55]:
train.head()

   id  campaign_id  coupon_id  customer_id  redemption_status  time  X  Y
0   1           13         27         1053                  0   104  1  0
1   2           13        116           48                  0   104  1  0
2   7           13        644         1050                  0   104  1  0
3  21           13       1028           89                  0   104  1  0
4  23           13        517         1067                  0   104  1  0

In [0]:
df6.customer_id=df6.index

In [0]:
df6=df6.drop("item_id",axis=1)

In [0]:
train=pd.merge(train,df6,on="customer_id")

In [0]:
train=train.sort_values("id")

In [60]:
train.customer_id.value_counts().shape

(1428,)

In [0]:

test=pd.merge(test,df1,on="campaign_id")
test=pd.merge(test,df6,on="customer_id")
test=test.sort_values("id")

In [62]:
test.head()

       id  campaign_id  coupon_id  ...  Skin & Hair Care  Travel  Vegetables (cut)
0       3           22        869  ...                11       0                 0
18257   4           20        389  ...                 2       2                 0
68      5           22        981  ...                 0       1                 0
27932   8           25       1069  ...                 0       0                 0
12518  10           17        498  ...                 3       1                 0

[5 rows x 33 columns]

In [63]:
df2.shape

(760, 20)

In [0]:
import xgboost
from sklearn.model_selection import cross_val_score

from xgboost import XGBClassifier

In [0]:
xgb = XGBClassifier(n_estimators= 1000, seed=100)

In [0]:
y=train.redemption_status
train=train.drop("redemption_status",axis=1)

In [0]:
train=train.astype(float)

In [0]:
id=test.id

In [0]:
idx=pd.DataFrame(id)

In [83]:
idx.head()

       id
0       3
18257   4
68      5
27932   8
12518  10

In [69]:
train.head()

        id  campaign_id  coupon_id  ...  Skin & Hair Care  Travel  Vegetables (cut)
0      1.0         13.0       27.0  ...               0.0     0.0               0.0
30     2.0         13.0      116.0  ...               0.0     0.0               0.0
10141  6.0          9.0      635.0  ...               4.0     0.0               0.0
45     7.0         13.0      644.0  ...               1.0     0.0               0.0
29579  9.0          8.0     1017.0  ...               0.0     0.0               0.0

[5 rows x 33 columns]

In [0]:
train=train.drop(["id","campaign_id","customer_id"],axis=1)

In [0]:
test=test.drop(["id","campaign_id","customer_id"],axis=1)

In [0]:
y=pd.DataFrame(y)

In [73]:
xgb.fit(train,y.iloc[:,0])

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.1, max_delta_step=0, max_depth=3,
              min_child_weight=1, missing=None, n_estimators=1000, n_jobs=1,
              nthread=None, objective='binary:logistic', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=100,
              silent=None, subsample=1, verbosity=1)

In [74]:
cross_val_score(xgb,train,y.iloc[:,0])

/usr/local/lib/python3.6/dist-packages/sklearn/model_selection/_split.py:1978: FutureWarning: The default value of cv will change from 3 to 5 in version 0.22. Specify it explicitly to silence this warning.
  warnings.warn(CV_WARNING, FutureWarning)

array([0.99088925, 0.99069785, 0.99027677])

In [0]:
test=test.astype(float)

In [0]:
result=xgb.predict_proba(test)

In [92]:
result=pd.DataFrame(result)
result.head()

          0         1
0  0.970249  0.029751
1  0.999035  0.000965
2  0.556698  0.443302
3  0.999999  0.000001
4  0.999724  0.000276

In [0]:
test1=pd.read_csv("test.csv")

In [0]:
result.iloc[:,0]=test1["id"]

In [94]:
result.head()

    0         1
0   3  0.029751
1   4  0.000965
2   5  0.443302
3   8  0.000001
4  10  0.000276

In [0]:
result.columns=["id","redemption_status"]

In [96]:
result.head()

   id  redemption_status
0   3           0.029751
1   4           0.000965
2   5           0.443302
3   8           0.000001
4  10           0.000276

In [0]:
#Writing the results for test data to a CSV file
file = open("submission1.csv", "w")
for k in range(50226):
   file.write(str(result.iloc[k,0]) + "," + str(result.iloc[k,1]) + "\n")
file.close()

In [98]:
result.shape

(50226, 2)

In [99]:
test1.shape

(50226, 4)